<script setup>
const { onClose } = defineProps({ onClose: Function });
</script>

<template>
  <aside class="side-header">
    <ul class="contacts-list">
      <li class="u-tools-hover" title="Телеграм">
        <a href="https://t.me/myrahkis" target="_blank">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            fill="none"
            viewBox="0 0 32 32"
            width="3.5rem"
            height="3.5rem"
          >
            <circle fill="url(#paint0_linear_87_7225)" cx="16" cy="16" r="14" />
            <path
              fill="currentColor"
              class="accent-shape"
              d="M 22.9866 10.2088 C 23.1112 9.40332 22.3454 8.76755 21.6292 9.082 L 7.36482 15.3448 C 6.85123 15.5703 6.8888 16.3483 7.42147 16.5179 L 10.3631 17.4547 C 10.9246 17.6335 11.5325 17.541 12.0228 17.2023 L 18.655 12.6203 C 18.855 12.4821 19.073 12.7665 18.9021 12.9426 L 14.1281 17.8646 C 13.665 18.3421 13.7569 19.1512 14.314 19.5005 L 19.659 22.8523 C 20.2585 23.2282 21.0297 22.8506 21.1418 22.1261 L 22.9866 10.2088 Z"
            />
            <defs>
              <linearGradient
                id="paint0_linear_87_7225"
                gradientUnits="userSpaceOnUse"
                x1="16"
                y1="2"
                x2="16"
                y2="30"
              >
                <stop stop-color="currentColor" />
                <stop stop-color="currentColor" offset="1" />
              </linearGradient>
            </defs>
          </svg>
        </a>
      </li>
      <li class="u-tools-hover" title="Github">
        <a href="https://github.com/myrahkis" target="_blank">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 20 20"
            width="3rem"
            height="3rem"
            version="1.1"
          >
            <defs></defs>
            <g
              id="Page-1"
              fill="none"
              fill-rule="evenodd"
              stroke="none"
              stroke-width="1"
            >
              <g
                id="Dribbble-Light-Preview"
                fill="currentColor"
                transform="translate(-140 -7559)"
              >
                <g id="icons" transform="translate(56 160)">
                  <path
                    id="github-[#142]"
                    d="M 94 7399 C 99.523 7399 104 7403.59 104 7409.25 C 104 7413.78 101.138 7417.62 97.167 7418.98 C 96.66 7419.08 96.48 7418.76 96.48 7418.49 C 96.48 7418.15 96.492 7417.05 96.492 7415.67 C 96.492 7414.72 96.172 7414.1 95.813 7413.78 C 98.04 7413.52 100.38 7412.66 100.38 7408.72 C 100.38 7407.6 99.992 7406.68 99.35 7405.97 C 99.454 7405.71 99.797 7404.66 99.252 7403.25 C 99.252 7403.25 98.414 7402.98 96.505 7404.3 C 95.706 7404.08 94.85 7403.96 94 7403.96 C 93.15 7403.96 92.295 7404.08 91.497 7404.3 C 89.586 7402.98 88.746 7403.25 88.746 7403.25 C 88.203 7404.66 88.546 7405.71 88.649 7405.97 C 88.01 7406.68 87.619 7407.6 87.619 7408.72 C 87.619 7412.65 89.954 7413.53 92.175 7413.79 C 91.889 7414.04 91.63 7414.49 91.54 7415.16 C 90.97 7415.42 89.522 7415.87 88.63 7414.3 C 88.63 7414.3 88.101 7413.32 87.097 7413.25 C 87.097 7413.25 86.122 7413.23 87.029 7413.87 C 87.029 7413.87 87.684 7414.19 88.139 7415.37 C 88.139 7415.37 88.726 7417.2 91.508 7416.58 C 91.513 7417.44 91.522 7418.25 91.522 7418.49 C 91.522 7418.76 91.338 7419.08 90.839 7418.98 C 86.865 7417.63 84 7413.78 84 7409.25 C 84 7403.59 88.478 7399 94 7399"
                  ></path>
                </g>
              </g>
            </g>
          </svg>
        </a>
      </li>
      <li class="u-tools-hover" title="Почта">
        <a href="mailto:myrahkis@yandex.ru">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            fill="none"
            viewBox="0 0 192 192"
            width="3.5rem"
            height="3.5rem"
          >
            <path
              stroke="currentColor"
              stroke-linejoin="round"
              stroke-width="12"
              d="M 22 46 h 148 v 100 H 22 Z"
            />
            <path
              stroke="currentColor"
              stroke-linecap="round"
              stroke-linejoin="round"
              stroke-width="12"
              d="m 30 54 l 54.686 54.686 c 6.249 6.249 16.379 6.249 22.628 0 L 162 54"
            />
            <path
              clip-rule="evenodd"
              fill="currentColor"
              fill-rule="evenodd"
              d="m 116.531 99.263 l 43.226 43.226 a 6 6 0 1 0 8.486 -8.485 L 125.239 91 l -8.708 8.263 Z m -46.213 -7.82 l -42.56 42.561 a 6 6 0 1 0 8.485 8.485 l 42.3 -42.301 l -8.225 -8.745 Z"
            />
          </svg>
        </a>
      </li>
      <li class="u-tools-hover" title="React портфолио">
        <a href="https://myrahkis.github.io/fridge-portfolio/" target="_blank">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            fill="currentColor"
            viewBox="0 0 512 512"
            width="4rem"
            height="4rem"
          >
            <g id="SVGRepo_bgCarrier" stroke-width="0" />
            <g
              id="SVGRepo_tracerCarrier"
              stroke-linecap="round"
              stroke-linejoin="round"
            />
            <g id="SVGRepo_iconCarrier">
              <path
                d="M 410.66 180.72 h 0 q -7.67 -2.62 -15.45 -4.88 q 1.29 -5.25 2.38 -10.56 c 11.7 -56.9 4.05 -102.74 -22.06 -117.83 c -25 -14.48 -66 0.61 -107.36 36.69 q -6.1 5.34 -11.95 11 q -3.9 -3.76 -8 -7.36 c -43.35 -38.58 -86.8 -54.83 -112.88 -39.69 c -25 14.51 -32.43 57.6 -21.9 111.53 q 1.58 8 3.55 15.93 c -6.15 1.75 -12.09 3.62 -17.77 5.6 C 48.46 198.9 16 226.73 16 255.59 c 0 29.82 34.84 59.72 87.77 77.85 q 6.44 2.19 13 4.07 Q 114.64 346 113 354.68 c -10 53 -2.2 95.07 22.75 109.49 c 25.77 14.89 69 -0.41 111.14 -37.31 q 5 -4.38 10 -9.25 q 6.32 6.11 13 11.86 c 40.8 35.18 81.09 49.39 106 34.93 c 25.75 -14.94 34.12 -60.14 23.25 -115.13 q -1.25 -6.3 -2.88 -12.86 q 4.56 -1.35 8.93 -2.79 c 55 -18.27 90.83 -47.81 90.83 -78 C 496 226.62 462.5 198.61 410.66 180.72 Z m -129 -81.08 c 35.43 -30.91 68.55 -43.11 83.65 -34.39 h 0 c 16.07 9.29 22.32 46.75 12.22 95.88 q -1 4.8 -2.16 9.57 a 487.83 487.83 0 0 0 -64.18 -10.16 a 481.27 481.27 0 0 0 -40.57 -50.75 Q 276 104.57 281.64 99.64 Z M 157.73 280.25 q 6.51 12.6 13.61 24.89 q 7.23 12.54 15.07 24.71 a 435.28 435.28 0 0 1 -44.24 -7.13 C 146.41 309 151.63 294.75 157.73 280.25 Z m 0 -48.33 c -6 -14.19 -11.08 -28.15 -15.25 -41.63 c 13.7 -3.07 28.3 -5.58 43.52 -7.48 q -7.65 11.94 -14.72 24.23 T 157.7 231.92 Z m 10.9 24.17 q 9.48 -19.77 20.42 -38.78 h 0 q 10.93 -19 23.27 -37.13 c 14.28 -1.08 28.92 -1.65 43.71 -1.65 s 29.52 0.57 43.79 1.66 q 12.21 18.09 23.13 37 t 20.69 38.6 Q 334 275.63 323 294.73 h 0 q -10.91 19 -23 37.24 c -14.25 1 -29 1.55 -44 1.55 s -29.47 -0.47 -43.46 -1.38 q -12.43 -18.19 -23.46 -37.29 T 168.6 256.09 Z M 340.75 305 q 7.25 -12.58 13.92 -25.49 h 0 a 440.41 440.41 0 0 1 16.12 42.32 A 434.44 434.44 0 0 1 326 329.48 Q 333.62 317.39 340.75 305 Z m 13.72 -73.07 q -6.64 -12.65 -13.81 -25 h 0 q -7 -12.18 -14.59 -24.06 c 15.31 1.94 30 4.52 43.77 7.67 A 439.89 439.89 0 0 1 354.47 231.93 Z M 256.23 124.48 h 0 a 439.75 439.75 0 0 1 28.25 34.18 q -28.35 -1.35 -56.74 0 C 237.07 146.32 246.62 134.87 256.23 124.48 Z M 145.66 65.86 c 16.06 -9.32 51.57 4 89 37.27 c 2.39 2.13 4.8 4.36 7.2 6.67 A 491.37 491.37 0 0 0 201 160.51 a 499.12 499.12 0 0 0 -64.06 10 q -1.83 -7.36 -3.3 -14.82 h 0 C 124.59 109.46 130.58 74.61 145.66 65.86 Z M 122.25 317.71 q -6 -1.71 -11.85 -3.71 c -23.4 -8 -42.73 -18.44 -56 -29.81 C 42.52 274 36.5 263.83 36.5 255.59 c 0 -17.51 26.06 -39.85 69.52 -55 q 8.19 -2.85 16.52 -5.21 a 493.54 493.54 0 0 0 23.4 60.75 A 502.46 502.46 0 0 0 122.25 317.71 Z m 111.13 93.67 c -18.63 16.32 -37.29 27.89 -53.74 33.72 h 0 c -14.78 5.23 -26.55 5.38 -33.66 1.27 c -15.14 -8.75 -21.44 -42.54 -12.85 -87.86 q 1.53 -8 3.5 -16 a 480.85 480.85 0 0 0 64.69 9.39 a 501.2 501.2 0 0 0 41.2 51 C 239.54 405.83 236.49 408.65 233.38 411.38 Z m 23.42 -23.22 c -9.72 -10.51 -19.42 -22.14 -28.88 -34.64 q 13.79 0.54 28.08 0.54 c 9.78 0 19.46 -0.21 29 -0.64 A 439.33 439.33 0 0 1 256.8 388.16 Z m 124.52 28.59 c -2.86 15.44 -8.61 25.74 -15.72 29.86 c -15.13 8.78 -47.48 -2.63 -82.36 -32.72 c -4 -3.44 -8 -7.13 -12.07 -11 a 484.54 484.54 0 0 0 40.23 -51.2 a 477.84 477.84 0 0 0 65 -10.05 q 1.47 5.94 2.6 11.64 h 0 C 383.81 377.58 384.5 399.56 381.32 416.75 Z m 17.4 -102.64 h 0 c -2.62 0.87 -5.32 1.71 -8.06 2.53 a 483.26 483.26 0 0 0 -24.31 -60.94 a 481.52 481.52 0 0 0 23.36 -60.06 c 4.91 1.43 9.68 2.93 14.27 4.52 c 44.42 15.32 71.52 38 71.52 55.43 C 475.5 274.19 446.23 298.33 398.72 314.11 Z"
              />
              <path
                d="M 256 298.55 a 43 43 0 1 0 -42.86 -43 A 42.91 42.91 0 0 0 256 298.55 Z"
              />
            </g>
          </svg>
        </a>
      </li>
    </ul>
    <button class="hide-side-header u-tools-hover" @click="onClose">
      <svg
        xmlns="http://www.w3.org/2000/svg"
        fill="none"
        viewBox="0 0 24 24"
        width="3rem"
        height="3rem"
      >
        <path
          fill="currentColor"
          d="M 9.71069 18.2929 C 10.1012 18.6834 10.7344 18.6834 11.1249 18.2929 L 16.0123 13.4006 C 16.7927 12.6195 16.7924 11.3537 16.0117 10.5729 L 11.1213 5.68254 C 10.7308 5.29202 10.0976 5.29202 9.70708 5.68254 C 9.31655 6.07307 9.31655 6.70623 9.70708 7.09676 L 13.8927 11.2824 C 14.2833 11.6729 14.2833 12.3061 13.8927 12.6966 L 9.71069 16.8787 C 9.32016 17.2692 9.32016 17.9023 9.71069 18.2929 Z"
        />
      </svg>
    </button>
  </aside>
</template>

<style scoped>
.side-header {
  grid-column: 3 / -1;
  grid-row: 2;
  display: flex;
  flex-direction: column;
  justify-content: space-between;
  height: 100%;
  background-color: var(--bg-color);
  padding: 1rem 0.5rem;
}
.contacts-list {
  display: flex;
  flex-direction: column;
  align-items: center;
  gap: 1rem;
  list-style: none;
}
.contacts-list li {
  display: flex;
  justify-content: center;
  align-items: center;
  width: fit-content;
  border-radius: 50%;
  padding: 1rem;
}

.u-tools-hover {
  svg {
    color: var(--icons-color);
  }

  svg path.accent-shape {
    color: var(--bg-color);
  }
}

.details-slide-enter-active,
.details-slide-leave-active {
  transition: transform 0.3s ease, opacity 0.2s ease;
}
.details-slide-enter-from,
.details-slide-leave-to {
  transform: translateX(-100%);
  opacity: 0;
}
.details-slide-enter-to,
.details-slide-leave-from {
  transform: translateX(0);
  opacity: 1;
}
</style>
